{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.3,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.3,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Blocked Driveway",
    "1": "HEAT/HOT WATER",
    "2": "Illegal Parking",
    "3": "Noise - Residential",
    "4": "Other",
    "5": "Snow or Ice"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Blocked Driveway": 0,
    "HEAT/HOT WATER": 1,
    "Illegal Parking": 2,
    "Noise - Residential": 3,
    "Other": 4,
    "Snow or Ice": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "use_cache": false,
  "vocab_size": 30522
}
